Examinator/src/InformationRegisters/ЗаданияНаОбновлениеДанныхВебКабинетаСУ/ЗаданияНаОбновлениеДанныхВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаданияНаОбновлениеДанныхВебКабинетаСУ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Важность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Параметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПовтора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяПроцедуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ЗаданияНаОбновлениеДанныхВебКабинетаСУ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Процедура ДобавитьЗадание(Знач ОбъектМетаданных, Знач ИмяПроцедуры, Знач Параметры, Знач Ключ, Знач Важность = 0, Знач НомерПовтора = 0) Экспорт
	
	Если ТипЗнч(Ключ) <> Тип("Строка") Тогда
		Ключ = Строка(Ключ); // Если передали уникальный идентификатор
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданияНаОбновлениеДанныхВебКабинетаСУ.Период
		|ИЗ
		|	РегистрСведений.ЗаданияНаОбновлениеДанныхВебКабинетаСУ КАК ЗаданияНаОбновлениеДанныхВебКабинетаСУ
		|ГДЕ
		|	ЗаданияНаОбновлениеДанныхВебКабинетаСУ.ОбъектМетаданных = &ОбъектМетаданных
		|	И ЗаданияНаОбновлениеДанныхВебКабинетаСУ.ИмяПроцедуры = &ИмяПроцедуры
		|	И ЗаданияНаОбновлениеДанныхВебКабинетаСУ.Ключ = &Ключ";
	
	Запрос.УстановитьПараметр("ИмяПроцедуры", ИмяПроцедуры);
	Запрос.УстановитьПараметр("Ключ", Ключ);
	Запрос.УстановитьПараметр("ОбъектМетаданных", ОбъектМетаданных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Если ТипЗнч(Параметры) = Тип("Массив") Тогда
		Параметры = Новый ФиксированныйМассив(Параметры);
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ЗаданияНаОбновлениеДанныхВебКабинетаСУ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектМетаданных.Установить(ОбъектМетаданных);
	НаборЗаписей.Отбор.ИмяПроцедуры.Установить(ИмяПроцедуры);
	НаборЗаписей.Отбор.Ключ.Установить(Ключ);
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДата);
	
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ОбъектМетаданных = ОбъектМетаданных;
	НоваяЗапись.ИмяПроцедуры = ИмяПроцедуры;
	НоваяЗапись.Ключ = Ключ;
	НоваяЗапись.Параметры = Новый ХранилищеЗначения(Параметры);
	НоваяЗапись.Период = ТекущаяДата;
	НоваяЗапись.Важность = Важность;
	НоваяЗапись.НомерПовтора = НомерПовтора;
	
	НаборЗаписей.Записать();	
	
КонецПроцедуры

Процедура УдалитьЗадание(ОбъектМетаданных, ИмяПроцедуры, Ключ, Период) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЗаданияНаОбновлениеДанныхВебКабинетаСУ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектМетаданных.Установить(ОбъектМетаданных);
	НаборЗаписей.Отбор.ИмяПроцедуры.Установить(ИмяПроцедуры);
	НаборЗаписей.Отбор.Ключ.Установить(Ключ);
	НаборЗаписей.Отбор.Период.Установить(Период);
	
	НаборЗаписей.Записать();	
	
КонецПроцедуры

Функция ПолучитьПервоеЗадание() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Задания.Период КАК Период,
		|	Задания.ОбъектМетаданных,
		|	Задания.ИмяПроцедуры,
		|	Задания.Ключ,
		|	Задания.Параметры,
		|	Задания.НомерПовтора
		|ИЗ
		|	РегистрСведений.ЗаданияНаОбновлениеДанныхВебКабинетаСУ КАК Задания
		|
		|УПОРЯДОЧИТЬ ПО
		|	Задания.Важность УБЫВ,
		|	Период";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции

Функция КоличествоЗаданий() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ЗаданияНаОбновлениеДанныхВебКабинетаСУ.Период) КАК Количество,
		|	ЗаданияНаОбновлениеДанныхВебКабинетаСУ.Важность
		|ИЗ
		|	РегистрСведений.ЗаданияНаОбновлениеДанныхВебКабинетаСУ КАК ЗаданияНаОбновлениеДанныхВебКабинетаСУ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаданияНаОбновлениеДанныхВебКабинетаСУ.Важность";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецЕсли
